Repository: oriveo/oriveo
Catalog: ios/Oriveo/Oriveo/Providers.xcstrings
Source language: en
Languages: ar, de, es, fr, hi, id, ja, ko, pt_br, ru, th, tr, vi, zh_hans, zh_hant

source: This image model is missing a valid image generation route in its server profile. Please update the app or contact support.
ar: يفتقد ملف تعريف الخادم لنموذج الصور هذا مسارًا صالحًا لتوليد الصور. حدّث التطبيق أو تواصل مع الدعم.
de: Im Serverprofil dieses Bildmodells fehlt eine gültige Route für die Bilderzeugung. Aktualisiere die App oder kontaktiere den Support.
es: Al perfil del servidor de este modelo de imagen le falta una ruta válida de generación de imágenes. Actualiza la app o contacta con soporte.
fr: Le profil serveur de ce modèle d’image ne contient pas de route valide de génération d’images. Mettez l’app à jour ou contactez l’assistance.
hi: इस इमेज मॉडल की सर्वर प्रोफ़ाइल में इमेज जनरेशन का मान्य रूट नहीं है। ऐप अपडेट करें या सहायता से संपर्क करें।
id: Profil server model gambar ini tidak memiliki rute pembuatan gambar yang valid. Perbarui aplikasi atau hubungi dukungan.
ja: この画像モデルのサーバープロファイルに有効な画像生成ルートがありません。アプリを更新するか、サポートにお問い合わせください。
ko: 이 이미지 모델의 서버 프로필에 유효한 이미지 생성 경로가 없습니다. 앱을 업데이트하거나 지원팀에 문의하세요.
pt_br: O perfil de servidor deste modelo de imagem não tem uma rota válida de geração de imagens. Atualize o app ou entre em contato com o suporte.
ru: В серверном профиле этой модели изображений отсутствует корректный маршрут генерации изображений. Обновите приложение или обратитесь в поддержку.
th: โปรไฟล์เซิร์ฟเวอร์ของโมเดลรูปภาพนี้ไม่มีเส้นทางการสร้างรูปภาพที่ถูกต้อง โปรดอัปเดตแอปหรือติดต่อฝ่ายสนับสนุน
tr: Bu görüntü modelinin sunucu profilinde geçerli bir görüntü oluşturma rotası yok. Uygulamayı güncelleyin veya destek ekibiyle iletişime geçin.
vi: Cấu hình máy chủ của mô hình hình ảnh này thiếu tuyến tạo hình ảnh hợp lệ. Hãy cập nhật ứng dụng hoặc liên hệ bộ phận hỗ trợ.
zh_hans: 此图像模型的服务器配置中缺少有效的图像生成路由。请更新 App 或联系支持。
zh_hant: 此影像模型的伺服器設定檔缺少有效的影像生成路由。請更新 App 或聯絡支援。

source: This looks like a local or LAN address. Over plain LAN HTTP, Oriveo won't send any credentials.
ar: يبدو هذا كعنوان محلي أو عنوان LAN. عبر LAN HTTP العادي، لن يرسل Oriveo أي بيانات اعتماد.
de: Dies sieht aus wie eine lokale oder LAN-Adresse. Über einfaches LAN-HTTP sendet Oriveo keine Anmeldeinformationen.
es: Esto parece una dirección local o LAN. A través de LAN HTTP simple, Oriveo no enviará ninguna credencial.
fr: Cela ressemble à une adresse locale ou LAN. Sur un simple réseau HTTP LAN, Oriveo n'enverra aucune information d'identification.
hi: यह एक स्थानीय या LAN पते जैसा दिखता है। सादे LAN HTTP पर, Oriveo कोई क्रेडेंशियल नहीं भेजेगा।
id: Ini terlihat seperti alamat lokal atau LAN. Melalui HTTP LAN biasa, Oriveo tidak akan mengirimkan kredensial apa pun.
ja: これはローカルまたは LAN アドレスのように見えます。プレーン LAN HTTP 経由では、Oriveo は認証情報を送信しません。
ko: 로컬 또는 LAN 주소처럼 보입니다. 일반 LAN HTTP를 통해 Oriveo는 자격 증명을 보내지 않습니다.
pt_br: Parece um endereço local ou LAN. Através de LAN HTTP simples, o Oriveo não enviará nenhuma credencial.
ru: Это похоже на локальный адрес или адрес локальной сети. По обычному протоколу HTTP в локальной сети Oriveo не отправляет никаких учетных данных.
th: ดูเหมือนว่าอยู่ในเครื่องหรือที่อยู่ LAN Oriveo จะไม่ส่งข้อมูลประจำตัวใดๆ บน LAN HTTP ธรรมดา
tr: Bu bir yerel veya LAN adresine benziyor. Düz LAN HTTP üzerinden Oriveo herhangi bir kimlik bilgisi göndermez.
vi: Địa chỉ này trông giống như địa chỉ cục bộ hoặc mạng LAN. Qua HTTP LAN đơn giản, Oriveo sẽ không gửi bất kỳ thông tin xác thực nào.
zh_hans: 这看起来是本机或局域网地址。按局域网明文 HTTP 连接时，Oriveo 不会发送任何凭据。
zh_hant: 這看起來是本機或區域網路位址。使用區域網路明文 HTTP 連線時，Oriveo 不會傳送任何憑證。

source: This model does not accept this parameter; sending it will be rejected.
ar: لا يقبل هذا النموذج هذه المَعلمة؛ سيُرفض إرسالها.
de: Dieses Modell akzeptiert diesen Parameter nicht; das Senden wird abgelehnt.
es: Este modelo no acepta este parámetro; enviarlo será rechazado.
fr: Ce modèle n'accepte pas ce paramètre ; l'envoyer sera rejeté.
hi: यह मॉडल इस पैरामीटर को स्वीकार नहीं करता; भेजने पर अस्वीकार हो जाएगा।
id: Model ini tidak menerima parameter ini; pengiriman akan ditolak.
ja: このモデルはこのパラメータを受け付けません。送信すると拒否されます。
ko: 이 모델은 이 매개변수를 받지 않으며, 보내면 거부됩니다.
pt_br: Este modelo não aceita este parâmetro; o envio será rejeitado.
ru: Эта модель не принимает данный параметр; отправка будет отклонена.
th: โมเดลนี้ไม่รับพารามิเตอร์นี้ ส่งไปจะถูกปฏิเสธ
tr: Bu model bu parametreyi kabul etmez; göndermek reddedilir.
vi: Mô hình này không chấp nhận tham số này; gửi đi sẽ bị từ chối.
zh_hans: 此模型不接受这个参数，发送会被拒绝
zh_hant: 此模型不接受這個參數，傳送會被拒絕

source: This model doesn't accept adjustable parameters on this connection.
ar: لا يقبل هذا النموذج معاملات قابلة للتعديل على هذا الاتصال.
de: Dieses Modell akzeptiert über diese Verbindung keine anpassbaren Parameter.
es: Este modelo no acepta parámetros ajustables en esta conexión.
fr: Ce modèle n'accepte aucun paramètre réglable sur cette connexion.
hi: इस कनेक्शन पर यह मॉडल समायोज्य पैरामीटर स्वीकार नहीं करता।
id: Model ini tidak menerima parameter yang dapat disesuaikan pada koneksi ini.
ja: このモデルはこの接続では調整可能なパラメータを受け付けません。
ko: 이 연결에서는 이 모델이 조정 가능한 매개변수를 받지 않습니다.
pt_br: Este modelo não aceita parâmetros ajustáveis nesta conexão.
ru: На этом подключении модель не принимает настраиваемые параметры.
th: โมเดลนี้ไม่รับพารามิเตอร์ที่ปรับได้บนการเชื่อมต่อนี้
tr: Bu model, bu bağlantıda ayarlanabilir parametre kabul etmiyor.
vi: Mô hình này không nhận tham số có thể điều chỉnh trên kết nối này.
zh_hans: 这个模型在这条连接上不接受可调参数。
zh_hant: 這個模型在這條連線上不接受可調參數。

source: This model's parameters are now managed by the official catalog and can't be customized here.
ar: أصبحت معاملات هذا الطراز الآن تحت إدارة الدليل الرسمي ولا يمكن تخصيصها هنا.
de: Die Parameter dieses Modells werden jetzt vom offiziellen Katalog verwaltet und können hier nicht angepasst werden.
es: Los parámetros de este modelo ahora los gestiona el catálogo oficial y no se pueden personalizar aquí.
fr: Les paramètres de ce modèle sont désormais gérés par le catalogue officiel et ne peuvent plus être personnalisés ici.
hi: इस मॉडल के पैरामीटर अब आधिकारिक कैटलॉग द्वारा प्रबंधित किए जाते हैं और यहां कस्टमाइज़ नहीं किए जा सकते।
id: Parameter model ini sekarang dikelola oleh katalog resmi dan tidak dapat disesuaikan di sini.
ja: このモデルのパラメータは現在公式カタログによって管理されており、ここではカスタマイズできません。
ko: 이 모델의 매개변수는 이제 공식 카탈로그에서 관리되며 여기서 사용자 지정할 수 없습니다.
pt_br: Os parâmetros deste modelo agora são gerenciados pelo catálogo oficial e não podem ser personalizados aqui.
ru: Параметры этой модели теперь управляются официальным каталогом и не могут быть настроены здесь.
th: พารามิเตอร์ของโมเดลนี้อยู่ภายใต้การจัดการของแคตตาล็อกอย่างเป็นทางการแล้ว และไม่สามารถปรับแต่งได้ที่นี่
tr: Bu modelin parametreleri artık resmi katalog tarafından yönetiliyor ve burada özelleştirilemiyor.
vi: Các tham số của mô hình này hiện do danh mục chính thức quản lý và không thể tùy chỉnh tại đây.
zh_hans: 该模型参数已由官方目录接管，暂不可在此自定义。
zh_hant: 該模型參數已由官方目錄接管，暫不可在此自訂。

source: This pairing code is invalid or contains a credential.
ar: رمز الاقتران غير صالح أو يحتوي على بيانات اعتماد.
de: Dieser Kopplungscode ist ungültig oder enthält Zugangsdaten.
es: Este código de vinculación no es válido o contiene credenciales.
fr: Ce code de jumelage est invalide ou contient un identifiant.
hi: यह पेयरिंग कोड अमान्य है या इसमें क्रेडेंशियल है।
id: Kode penyandingan ini tidak valid atau berisi kredensial.
ja: このペアリングコードは無効か、認証情報を含んでいます。
ko: 이 페어링 코드는 유효하지 않거나 자격 증명을 포함합니다.
pt_br: Este código de pareamento é inválido ou contém uma credencial.
ru: Код сопряжения недействителен или содержит учётные данные.
th: รหัสจับคู่นี้ไม่ถูกต้องหรือมีข้อมูลรับรอง
tr: Bu eşleştirme kodu geçersiz veya kimlik bilgisi içeriyor.
vi: Mã ghép nối này không hợp lệ hoặc chứa thông tin đăng nhập.
zh_hans: 此配对码无效或包含凭据。
zh_hant: 此配對碼無效或包含憑證。

source: This provider does not currently guarantee stable automatic model sync. Please continue with a manual model ID.
ar: لا يضمن هذا المزوّد حاليًا مزامنة النموذج التلقائي المستقرة. يرجى المتابعة باستخدام معرف النموذج اليدوي.
de: Dieser Anbieter garantiert derzeit keine stabile automatische Modellsynchronisierung. Bitte fahren Sie mit einer manuellen Modell-ID fort.
es: Actualmente, este proveedor no garantiza una sincronización automática estable del modelo. Continúe con una identificación de modelo manual.
fr: Ce fournisseur ne garantit pas actuellement une synchronisation automatique stable des modèles. Veuillez continuer avec un identifiant de modèle manuel.
hi: यह प्रदाता वर्तमान में स्थिर स्वचालित मॉडल सिंक की गारंटी नहीं देता है। कृपया मैन्युअल मॉडल आईडी के साथ जारी रखें।
id: Penyedia ini saat ini tidak menjamin sinkronisasi model otomatis yang stabil. Silakan lanjutkan dengan ID model manual.
ja: このプロバイダーは現在、安定した自動モデル同期を保証していません。手動モデル ID を続行してください。
ko: 이 제공업체는 현재 안정적인 자동 모델 동기화를 보장하지 않습니다. 수동 모델 ID를 사용하여 계속하세요.
pt_br: Atualmente, este provedor não garante sincronização automática estável do modelo. Continue com um ID de modelo manual.
ru: В настоящее время этот поставщик не гарантирует стабильную автоматическую синхронизацию моделей. Пожалуйста, продолжайте вводить идентификатор модели вручную.
th: ผู้ให้บริการรายนี้ไม่รับประกันการซิงค์โมเดลอัตโนมัติที่เสถียรในปัจจุบัน โปรดดำเนินการต่อด้วยรหัสรุ่นแบบแมนนวล
tr: Bu sağlayıcı şu anda kararlı otomatik model senkronizasyonunu garanti etmemektedir. Lütfen manuel model kimliğiyle devam edin.
vi: Nhà cung cấp này hiện không đảm bảo đồng bộ hóa mô hình tự động ổn định. Vui lòng tiếp tục với ID mẫu thủ công.
zh_hans: 此服务商暂不保证稳定的自动模型同步。请使用手动模型 ID 继续。
zh_hant: 該服務商目前不保證穩定的自動模型同步。請使用手動模型 ID 繼續。

source: This provider does not support automatic model sync. You can manually enter a model ID instead.
ar: لا يدعم هذا المزود مزامنة النماذج تلقائيًا. يمكنك إدخال معرّف النموذج يدويًا بدلًا من ذلك.
de: Dieser Anbieter unterstützt keine automatische Modellsynchronisierung. Du kannst stattdessen eine Modell-ID manuell eingeben.
es: Este proveedor no admite la sincronización automática de modelos. Puedes introducir un ID de modelo manualmente en su lugar.
fr: Ce fournisseur ne prend pas en charge la synchronisation automatique des modèles. Tu peux saisir un ID de modèle manuellement à la place.
hi: यह प्रदाता स्वचालित मॉडल सिंक का समर्थन नहीं करता। आप इसके बजाय मैन्युअल रूप से मॉडल ID दर्ज कर सकते हैं।
id: Penyedia ini tidak mendukung sinkronisasi model otomatis. Anda dapat memasukkan ID model secara manual sebagai gantinya.
ja: このプロバイダーは自動モデル同期をサポートしていません。代わりに手動でモデル ID を入力できます。
ko: 이 공급자는 자동 모델 동기화를 지원하지 않습니다. 대신 모델 ID를 수동으로 입력할 수 있습니다.
pt_br: Este provedor não suporta sincronização automática de modelos. Você pode inserir um ID de modelo manualmente.
ru: Этот провайдер не поддерживает автоматическую синхронизацию моделей. Вы можете ввести ID модели вручную.
th: ผู้ให้บริการนี้ไม่รองรับการซิงค์โมเดลอัตโนมัติ คุณสามารถใส่ ID โมเดลด้วยตนเองแทนได้
tr: Bu sağlayıcı otomatik model senkronizasyonunu desteklemiyor. Bunun yerine bir model ID'sini elle girebilirsiniz.
vi: Nhà cung cấp này không hỗ trợ đồng bộ mô hình tự động. Bạn có thể nhập ID mô hình thủ công.
zh_hans: 该供应商不支持自动同步模型,你可以手动输入模型 ID。
zh_hant: 該供應商不支援自動同步模型,你可以手動輸入模型 ID。

source: This custom LLM does not accept the current OpenAI service tier value. Open Providers → this connection → Connection settings → Compatibility and clear “OpenAI service tier”, then retry.
ar: لا يقبل هذا النموذج اللغوي الكبير المخصص قيمة OpenAI service tier الحالية. افتح المزوّدون ← هذه الاتصالات ← إعدادات الاتصال ← التوافق، ثم امسح «OpenAI service tier» وأعد المحاولة.
de: Dieses benutzerdefinierte LLM akzeptiert den aktuellen OpenAI-Service-Tier-Wert nicht. Öffne Anbieter → dieses benutzerdefinierte LLM → Verbindungseinstellungen → Kompatibilität und leere „OpenAI service tier“, dann versuche es erneut.
es: Este LLM personalizado no acepta el valor actual de OpenAI service tier. Abre Proveedores → este LLM personalizado → Configuración de conexión → Compatibilidad y borra «OpenAI service tier», luego reintenta.
fr: Ce LLM personnalisé n'accepte pas la valeur actuelle d'OpenAI service tier. Ouvre Fournisseurs → ce LLM personnalisé → Paramètres de connexion → Compatibilité et vide « OpenAI service tier », puis réessaie.
hi: यह कस्टम LLM मौजूदा OpenAI service tier मान स्वीकार नहीं करता। प्रदाता → यह कस्टम LLM → कनेक्शन सेटिंग्स → संगतता खोलें और “OpenAI service tier” खाली करें, फिर पुनः प्रयास करें।
id: LLM kustom ini tidak menerima nilai OpenAI service tier saat ini. Buka Penyedia → LLM kustom ini → Pengaturan koneksi → Kompatibilitas lalu kosongkan “OpenAI service tier”, kemudian coba lagi.
ja: このカスタム LLM は現在の OpenAI service tier 値を受け付けません。プロバイダー → この接続 → 接続設定 → 互換性を開き、「OpenAI service tier」をクリアしてから再試行してください。
ko: 이 사용자 지정 LLM는 현재 OpenAI service tier 값을 받아들이지 않습니다. 제공업체 → 이 사용자 지정 LLM → 연결 설정 → 호환성를 열어 “OpenAI service tier”를 비우고 다시 시도하세요.
pt_br: Este LLM personalizado não aceita o valor atual de OpenAI service tier. Abra Provedores → este LLM personalizado → Configurações de conexão → Compatibilidade e limpe “OpenAI service tier”, depois tente novamente.
ru: Эта пользовательская LLM не принимает текущее значение OpenAI service tier. Откройте Поставщики → это подключение → Настройки подключения → Совместимость и очистите «OpenAI service tier», затем повторите.
th: LLM แบบกำหนดเองนี้ไม่รับค่า OpenAI service tier ที่ตั้งไว้ เปิดผู้ให้บริการ → LLM แบบกำหนดเองนี้ → การตั้งค่าการเชื่อมต่อ → ความเข้ากันได้ แล้วล้างค่า “OpenAI service tier” จากนั้นลองใหม่
tr: Bu özel LLM mevcut OpenAI service tier değerini kabul etmiyor. Sağlayıcılar → bu özel LLM → Bağlantı ayarları → Uyumluluk bölümünü açın ve “OpenAI service tier” alanını boşaltıp tekrar deneyin.
vi: LLM tùy chỉnh này không chấp nhận giá trị OpenAI service tier hiện tại. Mở Nhà cung cấp → LLM tùy chỉnh này → Cài đặt kết nối → Tương thích rồi xóa “OpenAI service tier”, sau đó thử lại.
zh_hans: 此自定义 LLM 不接受当前的 OpenAI service tier 值。打开 供应商 → 该连接 → 连接设置 → 兼容性，清空“OpenAI service tier”后重试。
zh_hant: 此自訂 LLM 不接受目前的 OpenAI service tier 值。開啟 供應商 → 該連線 → 連線設定 → 相容性，清除「OpenAI service tier」後重試。

source: This custom LLM does not offer a dedicated image request URL. Open Providers → this custom LLM → Connection settings → Protocol and switch it to OpenAI Responses. Oriveo will then use the inline image tool path instead.
ar: لا يوفّر هذا النموذج اللغوي الكبير المخصص عنوان طلب مخصصًا للصور. افتح المزوّدون ← هذا الاتصال ← إعدادات الاتصال ← البروتوكول، ثم اختر OpenAI Responses. سيستخدم Oriveo بعدها مسار أداة الصور المضمنة.
de: Dieses benutzerdefinierte LLM bietet keine eigene Request-URL für Bilder. Öffne Anbieter → diese Verbindung → Verbindungseinstellungen → Protokoll und wechsle zu OpenAI Responses. Oriveo verwendet dann den integrierten Bild-Tool-Pfad.
es: Este LLM personalizado no ofrece un request URL dedicado para imágenes. Abre Proveedores → este LLM personalizado → Configuración de conexión → Protocolo y cámbialo a OpenAI Responses. Oriveo usará la ruta del tool de imagen inline.
fr: Ce LLM personnalisé ne propose pas d'request URL d'images dédié. Ouvrez Fournisseurs → ce LLM personnalisé → Paramètres de connexion → Protocole et choisissez OpenAI Responses ; Oriveo utilisera alors la route de l'outil d'image intégré.
hi: इस कस्टम LLM में छवियों के लिए अलग अनुरोध URL नहीं है। प्रदाता → यह कनेक्शन → कनेक्शन सेटिंग्स → प्रोटोकॉल खोलें और OpenAI Responses पर स्विच करें। फिर Oriveo इनलाइन इमेज टूल पथ का उपयोग करेगा।
id: LLM kustom ini tidak menyediakan request URL gambar khusus. Buka Penyedia → LLM kustom ini → Pengaturan koneksi → Protokol dan ubah ke OpenAI Responses. Oriveo akan memakai jalur tool gambar inline.
ja: このカスタム LLM には画像専用のリクエスト URL がありません。プロバイダー → この接続 → 接続設定 → プロトコルを開いて OpenAI Responses に切り替えてください。Oriveo はインライン画像ツールの経路を使います。
ko: 이 사용자 지정 LLM에는 전용 이미지 요청 URL이 없습니다. 제공업체 → 이 연결 → 연결 설정 → 프로토콜에서 OpenAI Responses로 바꾸세요. 그러면 Oriveo가 인라인 이미지 도구 경로를 사용합니다.
pt_br: Este LLM personalizado não oferece request URL de imagem dedicado. Abra Provedores → este LLM personalizado → Configurações de conexão → Protocolo e mude para OpenAI Responses. O Oriveo passará a usar a rota de ferramenta de imagem inline.
ru: У этой пользовательской LLM нет отдельного URL запроса для изображений. Откройте Поставщики → это подключение → Настройки подключения → Протокол и выберите OpenAI Responses. Затем Oriveo использует встроенный путь инструмента изображений.
th: LLM แบบกำหนดเองนี้ไม่มี URL คำขอสำหรับรูปภาพโดยเฉพาะ เปิดผู้ให้บริการ → การเชื่อมต่อนี้ → การตั้งค่าการเชื่อมต่อ → โปรโตคอล แล้วเปลี่ยนเป็น OpenAI Responses จากนั้น Oriveo จะใช้เส้นทางเครื่องมือรูปภาพแบบอินไลน์
tr: Bu özel LLM, görseller için ayrı bir istek URL’si sunmuyor. Sağlayıcılar → bu bağlantı → Bağlantı ayarları → Protokol bölümünde OpenAI Responses’a geçin; Oriveo satır içi görsel araç yolunu kullanır.
vi: LLM tùy chỉnh này không có request URL ảnh riêng. Mở Nhà cung cấp → LLM tùy chỉnh này → Cài đặt kết nối → Giao thức và chuyển sang OpenAI Responses; Oriveo sẽ dùng tuyến công cụ ảnh inline.
zh_hans: 此自定义 LLM 未提供独立图片请求 URL。打开 供应商 → 该连接 → 连接设置 → 协议，切换到 OpenAI Responses 后重试；Oriveo 会改走内联图片工具路径。
zh_hant: 此自訂 LLM 未提供獨立圖片請求 URL。開啟 供應商 → 該連線 → 連線設定 → 協議，切換到 OpenAI Responses 後重試；Oriveo 會改走內嵌圖片工具路徑。

source: This custom LLM expects an Anthropic-style x-api-key header. Open Providers → this connection → Connection settings → Auth and switch to “x-api-key”, then retry.
ar: يتوقع هذا النموذج اللغوي الكبير المخصص ترويسة x-api-key بأسلوب Anthropic. افتح المزوّدون ← هذه الاتصالات ← إعدادات الاتصال ← المصادقة، ثم اختر «x-api-key» وأعد المحاولة.
de: Dieses benutzerdefinierte LLM erwartet einen x-api-key-Header im Anthropic-Stil. Öffne Anbieter → dieses benutzerdefinierte LLM → Verbindungseinstellungen → Authentifizierung und wechsle zu „x-api-key“, dann versuche es erneut.
es: Este LLM personalizado espera una cabecera x-api-key estilo Anthropic. Abre Proveedores → este LLM personalizado → Configuración de conexión → Autenticación y cambia a «x-api-key», luego reintenta.
fr: Ce LLM personnalisé attend un en-tête x-api-key style Anthropic. Ouvre Fournisseurs → ce LLM personnalisé → Paramètres de connexion → Authentification et passe à « x-api-key », puis réessaie.
hi: इस कस्टम LLM को Anthropic-शैली का x-api-key हेडर चाहिए। प्रदाता → यह कस्टम LLM → कनेक्शन सेटिंग्स → प्रमाणीकरण खोलें और “x-api-key” पर स्विच करें, फिर पुनः प्रयास करें।
id: LLM kustom ini mengharapkan header x-api-key gaya Anthropic. Buka Penyedia → LLM kustom ini → Pengaturan koneksi → Autentikasi lalu ganti ke “x-api-key”, kemudian coba lagi.
ja: このカスタム LLM には Anthropic 形式の x-api-key ヘッダーが必要です。プロバイダー → この接続 → 接続設定 → 認証を開き、「x-api-key」に切り替えてから再試行してください。
ko: 이 사용자 지정 LLM는 Anthropic 스타일의 x-api-key 헤더를 요구합니다. 제공업체 → 이 사용자 지정 LLM → 연결 설정 → 인증을 열어 “x-api-key”로 전환한 뒤 다시 시도하세요.
pt_br: Este LLM personalizado espera um cabeçalho x-api-key no estilo Anthropic. Abra Provedores → este LLM personalizado → Configurações de conexão → Autenticação e mude para “x-api-key”, depois tente novamente.
ru: Этой пользовательской LLM нужен заголовок x-api-key в стиле Anthropic. Откройте Поставщики → это подключение → Настройки подключения → Аутентификация и переключитесь на «x-api-key», затем повторите.
th: LLM แบบกำหนดเองนี้คาดหวังส่วนหัว x-api-key สไตล์ Anthropic เปิดผู้ให้บริการ → LLM แบบกำหนดเองนี้ → การตั้งค่าการเชื่อมต่อ → การยืนยันตัวตน แล้วสลับเป็น “x-api-key” จากนั้นลองใหม่
tr: Bu özel LLM Anthropic tarzı x-api-key başlığını bekliyor. Sağlayıcılar → bu özel LLM → Bağlantı ayarları → Kimlik doğrulama bölümünü açın ve “x-api-key”e geçip tekrar deneyin.
vi: LLM tùy chỉnh này cần header x-api-key kiểu Anthropic. Mở Nhà cung cấp → LLM tùy chỉnh này → Cài đặt kết nối → Xác thực rồi đổi sang “x-api-key”, sau đó thử lại.
zh_hans: 此自定义 LLM 要求 Anthropic 风格的 x-api-key 认证头。打开 供应商 → 该连接 → 连接设置 → 鉴权方式，切换到“x-api-key”后重试。
zh_hant: 此自訂 LLM 要求 Anthropic 風格的 x-api-key 認證標頭。開啟 供應商 → 該連線 → 連線設定 → 驗證方式，切換到「x-api-key」後重試。

source: This custom LLM only exposes /v1/responses and rejects /chat/completions. Open Providers → this connection → Connection settings → protocol type and switch to “Codex style (Responses)”, then retry.
ar: لا يوفّر هذا النموذج اللغوي الكبير المخصص سوى ‎/v1/responses ويرفض ‎/chat/completions. افتح المزوّدون ← هذه الاتصالات ← إعدادات الاتصال ← نوع البروتوكول، ثم اختر «Codex style (Responses)» وأعد المحاولة.
de: Dieses benutzerdefinierte LLM bietet nur /v1/responses an und lehnt /chat/completions ab. Öffne Anbieter → dieses benutzerdefinierte LLM → Verbindungseinstellungen → Protokolltyp und wechsle zu „Codex style (Responses)“, dann versuche es erneut.
es: Este LLM personalizado solo expone /v1/responses y rechaza /chat/completions. Abre Proveedores → este LLM personalizado → Configuración de conexión → tipo de protocolo y cambia a «Codex style (Responses)», luego reintenta.
fr: Ce LLM personnalisé n'expose que /v1/responses et rejette /chat/completions. Ouvre Fournisseurs → ce LLM personnalisé → Paramètres de connexion → type de protocole et passe à « Codex style (Responses) », puis réessaie.
hi: यह कस्टम LLM केवल /v1/responses प्रदान करता है और /chat/completions को अस्वीकार करता है। प्रदाता → यह कस्टम LLM → कनेक्शन सेटिंग्स → प्रोटोकॉल प्रकार खोलें और “Codex style (Responses)” पर स्विच करें, फिर पुनः प्रयास करें।
id: LLM kustom ini hanya mengekspos /v1/responses dan menolak /chat/completions. Buka Penyedia → LLM kustom ini → Pengaturan koneksi → jenis protokol lalu ganti ke “Codex style (Responses)”, kemudian coba lagi.
ja: このカスタム LLM は /v1/responses のみを提供し、/chat/completions を拒否します。プロバイダー → この接続 → 接続設定 → プロトコルの種類を開き、「Codex style (Responses)」に切り替えてから再試行してください。
ko: 이 사용자 지정 LLM는 /v1/responses만 노출하며 /chat/completions를 거부합니다. 제공업체 → 이 사용자 지정 LLM → 연결 설정 → 프로토콜 유형을 열어 “Codex style (Responses)”으로 변경한 뒤 다시 시도하세요.
pt_br: Este LLM personalizado só expõe /v1/responses e rejeita /chat/completions. Abra Provedores → este LLM personalizado → Configurações de conexão → tipo de protocolo e mude para “Codex style (Responses)”, depois tente novamente.
ru: Эта пользовательская LLM предоставляет только /v1/responses и отклоняет /chat/completions. Откройте Поставщики → это подключение → Настройки подключения → тип протокола и переключитесь на «Codex style (Responses)», затем повторите.
th: LLM แบบกำหนดเองนี้เปิดเฉพาะ /v1/responses และปฏิเสธ /chat/completions เปิดผู้ให้บริการ → LLM แบบกำหนดเองนี้ → การตั้งค่าการเชื่อมต่อ → ประเภทโปรโตคอล แล้วเปลี่ยนเป็น “Codex style (Responses)” จากนั้นลองใหม่
tr: Bu özel LLM yalnızca /v1/responses'i sunar ve /chat/completions'ı reddeder. Sağlayıcılar → bu özel LLM → Bağlantı ayarları → protokol türü bölümünü açın ve “Codex style (Responses)”e geçip tekrar deneyin.
vi: LLM tùy chỉnh này chỉ mở /v1/responses và từ chối /chat/completions. Mở Nhà cung cấp → LLM tùy chỉnh này → Cài đặt kết nối → loại giao thức rồi chuyển sang “Codex style (Responses)”, sau đó thử lại.
zh_hans: 此自定义 LLM 只暴露 /v1/responses，拒绝 /chat/completions。打开 供应商 → 该连接 → 连接设置 → 协议类型，切换为“Codex（Responses）”后重试。
zh_hant: 此自訂 LLM 只暴露 /v1/responses，拒絕 /chat/completions。開啟 供應商 → 該連線 → 連線設定 → 協議類型，切換為「Codex（Responses）」後重試。
